export const informationData = {
  data: {
    getAllInformationsTrue: [
      {
        id: '6bba65d4-43c2-4e03-b4b0-5209441c82c6',
        name: 'about',
        title: 'О нас',
        content: `
          <p>ERIST store - это российский бренд женской одежды, созданный в 2016 году. Все началось с запуска трикотажной истории ручной работы. Сейчас наша команда состоит из обычных людей, но каждый из нас является профессионалом в своем деле. Мы с любовью и особым трепетом подходим к созданию и запуску каждой новой коллекции и стремимся предложить нашим клиентам только лучшее. Наш шоу-рум расположен в прекрасном городе Екатеринбурге, где мы и воплощаем наши идеи в реальность.</p>
          <p>Мы верим, что стильная и удобная одежда должна быть доступной каждому, поэтому основная идея нашего бренда заключается в создании актуальных базовых и комфортных вещей, которые можно легко сочетать между собой и создавать классные образы.</p>
          <p>Мы тщательно отбираем ткани и постоянно работаем над улучшением технологического процесса производства одежды, чтобы предлагать вам наши новые изделия в лучшем качестве и как можно быстрее. Наша цель - сделать каждого нашего клиента счастливым и уверенным в себе и в том, что он носит. Мы стремимся создавать одежду, которая подчеркивает индивидуальность каждого человека и помогает чувствовать себя комфортно.</p>
          <p>Каждый день мы встречаем все больше счастливых клиентов в нашем шоуруме, а также получаем приятную обратную связь от наших он-лайн покупателей. Мы ценим каждого из вас и стремимся создать особую атмосферу ощущения радости встречи и теплоты общения. Мы организуем различные мероприятия и акции, чтобы поддерживать взаимодействие с нашими клиентами, радовать вас и делиться нашими последними новостями и идеями. А также мы максимально открыты и откровенны со всеми нашими подписчиками в социальных сетях.</p>
          <p>Ваши доверие и поддержка - это то, что вдохновляет нас и помогает нам расти. Мы благодарны вам за то, что вы с нами и обещаем продолжать радовать вас новыми открытиями и уникальными коллекциями.</p>
          <p>Итак, присоединяйтесь к нам и еще нескольким тысячам наших постоянных покупателей и станьте частью прекрасного сообщества ERIST store. Давайте вместе создавать стильные образы и вдохновлять друг друга на новые модные подвиги!</p>
          <p>Следите за нами и вы увидите много интересного!</p>
          <p>Если у Вас возникли вопросы и предложения, пожалуйста, звоните или пишите! С радостью ответим!</p>
          <hr />
          <p>+7 912 050-76-66</p>
          <p><a href="mailto:wholesale@erist.store">wholesale@erist.store</a></p>
          <p>Екатеринбург</p>
          <hr />
          <p>ИП Бражникова Софья Леонидовна</p>
          <p>ИНН: 667015198696</p>
          <p>ОГРНИП: 320665800083125</p>
        `,
        status: true,
      },
      {
        id: 'c4ebe8ab-be09-4d1c-b3b2-0d3a46411ad6',
        name: 'contact-us',
        title: 'Контакты',
        content: `
          <p>Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat.</p>
          <p>Телефон: <a href="tel:+1234567890">+1 (234) 567-890</a></p>
        `,
        status: true,
      },
    ],
  },
};
